arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/edma/fsl_edma_driver.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_edma_driver.h"
#include "fsl_clock_manager.h"
#include "fsl_interrupt_manager.h"

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief EDMA global structure to maintain eDMA state */
static volatile edma_state_t *g_edma = NULL;

/*******************************************************************************
 * PROTOTYPES
 ******************************************************************************/
static edma_status_t EDMA_DRV_ClaimChannel(uint8_t channel, dma_request_source_t source, edma_chn_state_t *chn);
static void EDMA_DRV_ClearIntStatus(uint8_t channel);
static void EDMA_DRV_ClearSoftwareTCD(edma_software_tcd_t * stcd);
static bool EDMA_DRV_ValidTransferSize(edma_transfer_size_t size);

/*! @brief Macro for EDMA driver lock mechanism. */
#if (USE_RTOS)
    #define EDMA_DRV_LOCK()         OSA_MutexLock(&g_edma->lock, OSA_WAIT_FOREVER)
    #define EDMA_DRV_UNLOCK()       OSA_MutexUnlock(&g_edma->lock)
#else
    #define EDMA_DRV_LOCK()         do {}while (0)
    #define EDMA_DRV_UNLOCK()       do {}while (0)
#endif

/*******************************************************************************
 * Code
 ******************************************************************************/
/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_Init
 * Description   : Initializes the eDMA module.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_Init(edma_state_t *edmaState, const edma_user_config_t *userConfig)
{
    uint32_t i, dmaClkFreq, dmamuxClkFreq;
    DMA_Type * edmaRegBase;
    DMAMUX_Type * dmamuxRegBase;
    IRQn_Type irqNumber;

    CLOCK_SYS_GetFreq(dmaClockName, &dmaClkFreq);
    CLOCK_SYS_GetFreq(dmamuxClockName, &dmamuxClkFreq);

    /* Return an error if the clock is disabled for DMA operations */
    if ((dmaClkFreq == 0U) || (dmamuxClkFreq == 0U))
    {
        return EDMA_STATUS_CLOCK_GATED_OFF;
    }

    if (g_edma)
    {
        return EDMA_STATUS_SUCCESS;
    }

    g_edma = edmaState;

    /* Clear the state structure. */
    uint8_t *clearStructPtr = (uint8_t *)g_edma;
    uint8_t *lastByteAddr = (uint8_t *)g_edma + sizeof(edma_state_t);
    while (clearStructPtr < lastByteAddr)
    {
        *clearStructPtr = 0;
        clearStructPtr++;
    }

    edmaRegBase = g_edmaBase[0U];

    /* Init eDMA module on hardware level. */
    EDMA_HAL_Init(edmaRegBase);

    /* Set arbitration mode */
    EDMA_HAL_SetChannelArbitrationMode(edmaRegBase, userConfig->chnArbitration);

    /* Set 'Halt on error' configuration */
    EDMA_HAL_SetHaltOnErrorCmd(edmaRegBase, !userConfig->notHaltOnError);

#if defined FSL_FEATURE_EDMA_HAS_ERROR_IRQ
    /* Enable the error interrupt for eDMA module. */
    irqNumber = g_edmaErrIrqId[0U];
    INT_SYS_EnableIRQ(irqNumber);
#endif

    /* Register all edma channel interrupt handler into vector table. */
    for (i = 0U; i < FSL_FEATURE_EDMA_MODULE_CHANNELS; i++)
    {
        /* Enable channel interrupt ID. */
        irqNumber = g_edmaIrqId[i];
        INT_SYS_EnableIRQ(irqNumber);
    }

    /* Initialize DMAMUX */
    dmamuxRegBase = g_dmamuxBase[0U];
    DMAMUX_HAL_Init(dmamuxRegBase);

    return EDMA_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_Deinit
 * Description   : Deinitialize EDMA.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_Deinit(void)
{
    uint32_t i;
    IRQn_Type irqNumber;
    edma_chn_state_t *chn;

    /* Release all edma channel. */
#if defined FSL_FEATURE_EDMA_HAS_ERROR_IRQ
    /* Disable the error interrupt for eDMA module. */
    irqNumber = g_edmaErrIrqId[0U];
    INT_SYS_DisableIRQ(irqNumber);
#endif

    for (i = 0U; i < FSL_FEATURE_EDMA_MODULE_CHANNELS; i++)
    {
        /* Release all channels. */
        chn = g_edma->chn[i];
        if (chn)
        {
            EDMA_DRV_ReleaseChannel(chn);
        }

        /* Disable channel interrupt ID. */
        irqNumber = g_edmaIrqId[i];
        INT_SYS_DisableIRQ(irqNumber);
    }

    g_edma = NULL;

    return EDMA_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ChannelInit
 * Description   : Initialize EDMA channel.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_ChannelInit(edma_chn_state_t *edmaChannelState, const edma_channel_config_t *edmaChannelConfig)
{
    uint8_t allocatedChannel;
    DMA_Type * edmaRegBase = g_edmaBase[0U];

    /* Check if the channel defined by user in the channel configuration structure is valid */
    if ((edmaChannelConfig->channel > FSL_FEATURE_EDMA_MODULE_CHANNELS) && (edmaChannelConfig->channel != EDMA_ANY_CHANNEL))
    {
        return EDMA_STATUS_INVALID_ARGUMENT;
    }

    /* Request the channel */
    allocatedChannel = EDMA_DRV_RequestChannel(edmaChannelConfig->channel, edmaChannelConfig->source, edmaChannelState);
    if (allocatedChannel == EDMA_INVALID_CHANNEL)
    {
        return EDMA_STATUS_FAIL;
    }

