arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/edma/fsl_edma_driver.c
    /* Set the channel priority, as defined in the configuration structure, only if fixed arbitration mode is selected */
    if ((edmaChannelConfig->priority != EDMA_CHN_DEFAULT_PRIORITY) && !EDMA_HAL_GetChannelArbitrationMode(edmaRegBase))
    {
        EDMA_HAL_SetChannelPriority(edmaRegBase, allocatedChannel, edmaChannelConfig->priority);
    }

    /* Install the user callback */
    EDMA_DRV_InstallCallback(edmaChannelState, edmaChannelConfig->callback, edmaChannelConfig->callbackParam);

    return EDMA_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_InstallCallback
 * Description   : Register callback function and parameter.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_InstallCallback(edma_chn_state_t *chn, edma_callback_t callback, void *parameter)
{
    chn->callback = callback;
    chn->parameter = parameter;

    return EDMA_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_RequestChannel
 * Description   : Request an eDMA channel.
 *
 *END**************************************************************************/
uint8_t EDMA_DRV_RequestChannel(uint8_t channel, dma_request_source_t source, edma_chn_state_t *chn)
{
    /*Check if dynamic allocation is requested */
    if (channel == EDMA_ANY_CHANNEL)
    {
        uint32_t i;

        for (i=0U; i < FSL_FEATURE_DMAMUX_MODULE_CHANNELS; i++)
        {
            EDMA_DRV_LOCK();
            if (!g_edma->chn[i])
            {
                g_edma->chn[i] = chn;
                EDMA_DRV_UNLOCK();
                EDMA_DRV_ClaimChannel(i, source, chn);
                return i;
            }
            EDMA_DRV_UNLOCK();
        }

        /* No available channel. */
        return EDMA_INVALID_CHANNEL;
    }

    /* Static allocation */
    EDMA_DRV_LOCK();
    if (!g_edma->chn[channel])
    {
        g_edma->chn[channel] = chn;
        EDMA_DRV_UNLOCK();
        EDMA_DRV_ClaimChannel(channel, source, chn);
        return channel;
    }
    EDMA_DRV_UNLOCK();

    return EDMA_INVALID_CHANNEL;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ClaimChannel
 * Description   : Claim an edma channel.
 *
 *END**************************************************************************/
static edma_status_t EDMA_DRV_ClaimChannel(uint8_t channel, dma_request_source_t source, edma_chn_state_t *chn)
{
    DMA_Type * edmaRegBase = g_edmaBase[0U];
    DMAMUX_Type * dmamuxRegBase = g_dmamuxBase[0U];

    /* Reset the channel state structure to default value. */
    uint8_t *clearStructPtr = (uint8_t *)chn;
    uint8_t *lastByteAddr = (uint8_t *)chn + sizeof(edma_chn_state_t);
    while (clearStructPtr < lastByteAddr)
    {
        *clearStructPtr = 0;
        clearStructPtr++;
    }

    /* Init the channel state structure to the allocated channel number. */
    chn->channel = channel;

    /* Enable error interrupt for this channel */
    EDMA_HAL_SetErrorIntCmd(edmaRegBase, (edma_channel_indicator_t)channel, true);

    /* Configure the DMAMUX for edma channel */
    DMAMUX_HAL_SetChannelCmd(dmamuxRegBase, channel, false);
    DMAMUX_HAL_SetTriggerSource(dmamuxRegBase, channel, (uint8_t)source);
    DMAMUX_HAL_SetChannelCmd(dmamuxRegBase, channel, true);

    /* Clear the TCD registers for this channel */
    EDMA_HAL_TCDClearReg(edmaRegBase, channel);

    return EDMA_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ReleaseChannel
 * Description   : Free eDMA channel's hardware and software resource.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_ReleaseChannel(edma_chn_state_t *chn)
{
    uint8_t channel = chn->channel;
    DMA_Type * edmaRegBase = g_edmaBase[0U];

    if (!g_edma->chn[channel])
    {
        return EDMA_STATUS_INVALID_ARGUMENT;
    }

    /* Stop edma channel. */
    EDMA_HAL_SetDmaRequestCmd(edmaRegBase,(edma_channel_indicator_t)channel, false);

    /* Reset the channel state structure to default value. */
    uint8_t *clearStructPtr = (uint8_t *)chn;
    uint8_t *lastByteAddr = (uint8_t *)chn + sizeof(edma_chn_state_t);
    while (clearStructPtr < lastByteAddr)
    {
        *clearStructPtr = 0;
        clearStructPtr++;
    }

    EDMA_DRV_LOCK();
    g_edma->chn[channel] = NULL;
    EDMA_DRV_UNLOCK();
    return EDMA_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ClearIntStatus
 * Description   : Clear done and interrupt status.
 *
 *END**************************************************************************/
static void EDMA_DRV_ClearIntStatus(uint8_t channel)
{
    DMA_Type * edmaRegBase = g_edmaBase[0U];

    EDMA_HAL_ClearDoneStatusFlag(edmaRegBase, (edma_channel_indicator_t)channel);
    EDMA_HAL_ClearIntStatusFlag(edmaRegBase, (edma_channel_indicator_t)channel);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ClearSoftwareTCD
 * Description   : Clear the software tcd structure.
 *
 *END**************************************************************************/
static void EDMA_DRV_ClearSoftwareTCD(edma_software_tcd_t * stcd)
{
    uint8_t *byteAccess, *stcdAddr;
    stcdAddr = (uint8_t *)stcd;
    for (byteAccess = stcdAddr; byteAccess < stcdAddr + sizeof(edma_software_tcd_t); byteAccess++)
    {
        *byteAccess = 0;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_IRQ_HANDLER
 * Description   : EDMA IRQ handler.
 *
 *END**************************************************************************/
void EDMA_DRV_IRQHandler(uint8_t channel)
{
    edma_chn_state_t *chn = g_edma->chn[channel];

    EDMA_DRV_ClearIntStatus(channel);

    if (!chn)
    {
        return;
    }

