arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/edma/fsl_edma_driver.c
    if (chn->callback)
    {
        chn->callback(chn->parameter, chn->status);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DMA_ERR_IRQHandler
 * Description   : EDMA error handler
 *
 *END**************************************************************************/
void EDMA_DRV_ErrorIRQHandler(void)
{
    uint32_t channel = 0U, error;
    DMA_Type * edmaRegBase = g_edmaBase[0U];
    edma_chn_state_t *chn;

    error = EDMA_HAL_GetErrorIntStatusFlag(edmaRegBase);

    while (error && (channel < FSL_FEATURE_EDMA_MODULE_CHANNELS))
    {
        if (error & EDMA_ERR_LSB_MASK)
        {
            EDMA_HAL_SetDmaRequestCmd(edmaRegBase, (edma_channel_indicator_t)channel, false);
            chn = g_edma->chn[channel];
            if (chn)
            {
                EDMA_DRV_ClearIntStatus(channel);
                chn->status = EDMA_CHN_ERROR;
                if (chn->callback)
                {
                    chn->callback(chn->parameter, chn->status);
                }
            }
        }
        error = error >> 1U;
        channel++;
    }
    EDMA_HAL_SetHaltCmd(edmaRegBase, false);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ConfigSingleBlockTransfer
 * Description   : Configures a DMA single block transfer.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_ConfigSingleBlockTransfer(
                            edma_chn_state_t *chn, edma_transfer_type_t type,
                            uint32_t srcAddr, uint32_t destAddr,
                            edma_transfer_size_t transferSize, uint32_t dataBufferSize)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(chn != NULL);
#endif

    DMA_Type * edmaRegBase = g_edmaBase[0U];
    uint8_t transferOffset;

    /* Check if the value passed for 'transferSize' is valid */
    if (!EDMA_DRV_ValidTransferSize(transferSize))
    {
        return EDMA_STATUS_INVALID_ARGUMENT;
    }

    /* Compute the transfer offset, based on transfer size. 
     * The number of bytes transferred in each source read/destination write
     * is obtained with the following formula:
     *    source_read_size = 2^SSIZE
     *    destination_write_size = 2^DSIZE
     */
    transferOffset = 1U << ((uint8_t)transferSize);

    /* The number of bytes to be transferred (buffer size) must
     * be a multiple of the source read/destination write size
     */
    if (dataBufferSize % transferOffset != 0U)
    {
        return EDMA_STATUS_INVALID_ARGUMENT;
    }

    /* Clear transfer control descriptor for the current channel */
    EDMA_HAL_TCDClearReg(edmaRegBase, chn->channel);

    /* Configure source and destination addresses */
    EDMA_HAL_TCDSetSrcAddr(edmaRegBase, chn->channel, srcAddr);
    EDMA_HAL_TCDSetDestAddr(edmaRegBase, chn->channel, destAddr);

    /* Set transfer size (1B/2B/4B/16B/32B) */
    EDMA_HAL_TCDSetAttribute(edmaRegBase, chn->channel, EDMA_MODULO_OFF, EDMA_MODULO_OFF, transferSize, transferSize);

    /* Configure source/destination offset. */
    switch (type)
    {
        case EDMA_TRANSFER_PERIPH2MEM:
            EDMA_HAL_TCDSetSrcOffset(edmaRegBase, chn->channel, 0);
            EDMA_HAL_TCDSetDestOffset(edmaRegBase, chn->channel, transferOffset);
            break;
        case EDMA_TRANSFER_MEM2PERIPH:
            EDMA_HAL_TCDSetSrcOffset(edmaRegBase, chn->channel, transferOffset);
            EDMA_HAL_TCDSetDestOffset(edmaRegBase, chn->channel, 0);
            break;
        case EDMA_TRANSFER_MEM2MEM:
            EDMA_HAL_TCDSetSrcOffset(edmaRegBase, chn->channel, transferOffset);
            EDMA_HAL_TCDSetDestOffset(edmaRegBase, chn->channel, transferOffset);
            break;
    }

    /* Set the total number of bytes to be transfered */
    EDMA_HAL_TCDSetNbytes(edmaRegBase, chn->channel, dataBufferSize);

    /* Set major iteration count to 1 (single block mode) */
    EDMA_HAL_TCDSetMajorCount(edmaRegBase, chn->channel, 1U);

    /* Enable interrupt when the transfer completes */
    EDMA_HAL_TCDSetIntCmd(edmaRegBase, chn->channel, true);

    return EDMA_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ConfigLoopTransfer
 * Description   : Configures the DMA transfer in a loop.
 *
 *END**************************************************************************/

edma_status_t EDMA_DRV_ConfigLoopTransfer(edma_chn_state_t *chn, edma_transfer_config_t *transferConfig)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(transferConfig != 0)
    DEV_ASSERT(chn != NULL);
#endif

    /* Check if the minor/major loop properties are defined */
    if (transferConfig->loopTransferConfig == NULL)
        return EDMA_STATUS_INVALID_ARGUMENT;

    /* Enable minor loop mapping */
    DMA_Type * edmaRegBase = g_edmaBase[0U];
    EDMA_HAL_SetMinorLoopMappingCmd(edmaRegBase, true);

    /* Write the configuration in the transfer control descriptor registers */
    EDMA_DRV_PushConfigToReg(chn, transferConfig);

    /* Enable interrupt when major loop count completes */
    EDMA_HAL_TCDSetIntCmd(edmaRegBase, chn->channel, true);

    return EDMA_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ConfigScatterGatherTransfer
 * Description   : Configure eDMA for scatter/gather operation
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_ConfigScatterGatherTransfer(
                        edma_chn_state_t *chn, edma_software_tcd_t *stcd,
                        edma_transfer_size_t transferSize, uint32_t bytesOnEachRequest,
                        edma_scatter_gather_list_t *srcList, edma_scatter_gather_list_t *destList,
                        uint8_t tcdCount)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(stcd != 0)
    DEV_ASSERT(chn != NULL);
#endif

