arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/edma/fsl_edma_driver.c
    uint8_t i, transferOffset;
    edma_software_tcd_t *stcdAddr = (edma_software_tcd_t *)STCD_ADDR(stcd);
    edma_loop_transfer_config_t loopConfig;
    edma_transfer_config_t config;

    /* Check if the value passed for 'transferSize' is valid */
    if (!EDMA_DRV_ValidTransferSize(transferSize))
    {
        return EDMA_STATUS_INVALID_ARGUMENT;
    }
    
    /* Compute the transfer offset, based on transfer size. 
     * The number of bytes transferred in each source read/destination write
     * is obtained with the following formula:
     *    source_read_size = 2^SSIZE
     *    destination_write_size = 2^DSIZE
     */
    transferOffset = 1U << ((uint8_t)transferSize);

    /* The number of bytes to be transferred on each request must
     * be a multiple of the source read/destination write size
     */
    if ((bytesOnEachRequest % transferOffset) != 0U)
    {
        return EDMA_STATUS_INVALID_ARGUMENT;
    }

    /* Clear the configuration structures before initializing them. */
    uint8_t *clearStructPtr = (uint8_t *)(&config);
    uint8_t *lastByteAddr = (uint8_t *)(&config) + sizeof(edma_transfer_config_t);
    while (clearStructPtr < lastByteAddr)
    {
        *clearStructPtr = 0;
        clearStructPtr++;
    }

    clearStructPtr = (uint8_t *)(&loopConfig);
    lastByteAddr = (uint8_t *)(&loopConfig) + sizeof(edma_loop_transfer_config_t);
    while (clearStructPtr < lastByteAddr)
    {
        *clearStructPtr = 0;
        clearStructPtr++;
    }

    /* Configure the transfer for scatter/gather mode. */
    config.srcLastAddrAdjust = 0U;
    config.destLastAddrAdjust = 0U;
    config.srcModulo = EDMA_MODULO_OFF;
    config.destModulo = EDMA_MODULO_OFF;
    config.srcTransferSize = transferSize;
    config.destTransferSize = transferSize;
    config.minorByteTransferCount = bytesOnEachRequest;
    config.interruptEnable = true;
    config.scatterGatherEnable = true;
    config.loopTransferConfig = &loopConfig;
    config.loopTransferConfig->srcOffsetEnable = false;
    config.loopTransferConfig->dstOffsetEnable = false;
    config.loopTransferConfig->minorLoopChnLinkEnable = false;
    config.loopTransferConfig->majorLoopChnLinkEnable = false;

    /* Copy scatter/gather lists to transfer configuration*/
    for (i = 0U; i < tcdCount; i++)
    {
        config.srcAddr = srcList[i].address;
        config.destAddr = destList[i].address;
        if ((srcList[i].length != destList[i].length) || (srcList[i].type != destList[i].type))
        {
            return EDMA_STATUS_INVALID_ARGUMENT;
        }
        config.loopTransferConfig->majorLoopIterationCount = srcList[i].length/bytesOnEachRequest;

        switch (srcList[i].type)
        {
            case EDMA_TRANSFER_PERIPH2MEM:
                /* Configure Source Read. */
                config.srcOffset = 0;
                /* Configure Dest Write. */
                config.destOffset = transferOffset;
                break;
            case EDMA_TRANSFER_MEM2PERIPH:
                /* Configure Source Read. */
                config.srcOffset = transferOffset;
                /* Configure Dest Write. */
                config.destOffset = 0;
                break;
            case EDMA_TRANSFER_MEM2MEM:
                /* Configure Source Read. */
                config.srcOffset = transferOffset;
                /* Configure Dest Write. */
                config.destOffset = transferOffset;
                break;
            default:
                return EDMA_STATUS_INVALID_ARGUMENT;
        }

        /* Configure the pointer to next software TCD structure; for the last one, this address should be 0 */
        if (i == tcdCount - 1)
        {
            config.scatterGatherNextDescAddr = 0U;
        }
        else
        {
            config.scatterGatherNextDescAddr = ((uint32_t) &stcdAddr[i+1]);
        }

        /* Copy configuration to software TCD structure */
        EDMA_DRV_PushConfigToSTCD(chn, &config, &stcdAddr[i]);

        /* Push the configuration for the first descriptor to registers */
        if (i == 0U)
        {
            EDMA_DRV_PushConfigToReg(chn, &config);
        }
    }

    return EDMA_STATUS_SUCCESS;

}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_StartChannel
 * Description   : Starts an eDMA channel.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_StartChannel(edma_chn_state_t *chn)
{
    uint8_t channel = chn->channel;
    DMA_Type * edmaRegBase = g_edmaBase[0U];

    EDMA_HAL_SetDmaRequestCmd(edmaRegBase, (edma_channel_indicator_t)channel, true);

    return EDMA_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_StopChannel
 * Description   : Stops an eDMA channel.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_StopChannel(edma_chn_state_t *chn)
{
    uint8_t channel = chn->channel;
    DMA_Type * edmaRegBase = g_edmaBase[0U];

    EDMA_HAL_SetDmaRequestCmd(edmaRegBase, (edma_channel_indicator_t)channel, false);

    return EDMA_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_PushConfigToSTCD
 * Description   : Copy the configuration to the software TCD structure.
 *
 *END**************************************************************************/
void EDMA_DRV_PushConfigToSTCD(edma_chn_state_t *chn, edma_transfer_config_t *config, edma_software_tcd_t *stcd)
{
    /* Clear the array of software TCDs passed by the user */
    EDMA_DRV_ClearSoftwareTCD(stcd);

    /* Set the software TCD fields */
    stcd->ATTR = (config->srcModulo << DMA_TCD_ATTR_SMOD_SHIFT) | (config->srcTransferSize << DMA_TCD_ATTR_SSIZE_SHIFT) |
                 (config->destModulo << DMA_TCD_ATTR_DMOD_SHIFT) | (config->destTransferSize << DMA_TCD_ATTR_DSIZE_SHIFT);
    stcd->SADDR = config->srcAddr;
    stcd->SOFF = config->srcOffset;
    stcd->NBYTES = config->minorByteTransferCount;
    stcd->SLAST = config->srcLastAddrAdjust;
    stcd->DADDR = config->destAddr;
    stcd->DOFF = config->destOffset;
    stcd->CITER = config->loopTransferConfig->majorLoopIterationCount;
    if (config->scatterGatherEnable)
    {
        stcd->DLAST_SGA = config->scatterGatherNextDescAddr;
    }
    else
    {
        stcd->DLAST_SGA = config->destLastAddrAdjust;
    }
    stcd->CSR = (config->interruptEnable << DMA_TCD_CSR_INTMAJOR_SHIFT) | (config->scatterGatherEnable << DMA_TCD_CSR_ESG_SHIFT);
    stcd->BITER = config->loopTransferConfig->majorLoopIterationCount;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_PushConfigToReg
 * Description   : Copy the configuration to the TCD registers.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_PushConfigToReg(edma_chn_state_t *chn, edma_transfer_config_t *tcd)
{
    uint32_t channel = chn->channel;
    DMA_Type * edmaRegBase = g_edmaBase[0U];

    /* Clear TCD registers */
    EDMA_HAL_TCDClearReg(edmaRegBase, channel);

    /* Set source and destination addresses */
    EDMA_HAL_TCDSetSrcAddr(edmaRegBase, channel, tcd->srcAddr);
    EDMA_HAL_TCDSetDestAddr(edmaRegBase, channel, tcd->destAddr);

    /* Set source/destination modulo feature and transfer size */
    EDMA_HAL_TCDSetAttribute(edmaRegBase, channel, tcd->srcModulo, tcd->destModulo, tcd->srcTransferSize, tcd->destTransferSize);

